Revit 2027 API
SpecTypeId.WireDiameter Property
 Wire Diameter, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WireDiameter { get; }
Public Shared ReadOnly Property WireDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WireDiameter {
	ForgeTypeId^ get ();
}
static member WireDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace